app/views/order/show_order.html.erb

      <ul>
        <%- @order.products.each do |product| %>
---
SELECT "products".* FROM "products" INNER JOIN "order_items" ON "products"."id" = "order_items"."product_id" WHERE "order_items"."order_id" = ?  [["order_id", 339]]