app/controllers/order_controller.rb

  def index
    @customer = Customer.find(params[:customer_id])
    @categories = Category.all
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "categories".* FROM "categories"

  def show
    @orders = Order.all
---
SELECT "orders".* FROM "orders"

  def show_order
    @order = Order.find params[:id]
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "339"]]

  def create
    @customer = Customer.find params[:order]["customer_id"]
    product_ids = params[:order]["product_ids"].split(",")
    @order = @customer.orders.build(product_ids: product_ids)

    if @order.save
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "orders" ("created_at", "customer_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 06 Feb 2014 10:34:42 UTC +00:00], ["customer_id", 1], ["updated_at", Thu, 06 Feb 2014 10:34:42 UTC +00:00]]