app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "encrypted_password", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "encrypted_password" = ?, "admin" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["encrypted_password", "$2a$10$L3mxCdI35J49mAaLHaSUX.9CRf6QlF8d/P2KIZ4gGJrKvxclKyTX2"], ["admin", true], ["updated_at", Thu, 06 Feb 2014 10:35:08 UTC +00:00]]